# Never On Top, But Still The Champs

**Summary:** Quick-scan research to write an article based on this fun fact: the 2019 Washington Nationals were just the second champ to win the World Series without having spent a single day in first place.`m

**For MLBTR Article:** https://www.mlbtraderumors.com/2020/06/what-the-washington-nationals-couldnt-accomplish-in-2019.html

# Imports

In [1]:
import pandas as pd
import numpy as np

**Step:** Collect Number of Days in First for every champ of the Wild card Era.

In [2]:
# teams to have won the World Series in the wild card era (1995-present)
team = ['WAS','BOS','HOU','CHC','KCR','SFG','BOS','SFG','STL','SFG',
       'NYY','PHI','BOS','STL','CWS','BOS','FLA','ANA','ARI','NYY',
       'NYY','NYY','FLA','NYY','ATL']

In [3]:
# number of days each of those champs spent in first place during the regular season
days_in_1st = [0,148,154,159,143,89,141,79,63,33,
              82,79,150,129,161,34,0,12,108,127,
              131,135,11,138,91]

In [4]:
# the year, in order, that the teams above won the World Series
year =[2019,2018,2017,2016,2015,2014,2013,2012,2011,2010,
      2009,2008,2007,2006,2005,2004,2003,2002,2001,2000,
      1999,1998,1997,1996,1995]

In [5]:
# list of wild card teams to win the World Series
WC_champs = ['FLA','FLA','ANA','BOS','STL','SFG','WAS']

In [6]:
# the years those teams won the World Series
WC_years = [1997,2003,2002,2004,2011,2014,2019]

**Step::** Putting the World Series teams into a simple DataFrame to easily get the describe stats (namely, mean and standard deviation)

In [7]:
first = sum(days_in_1st)

In [9]:
# calculating the average number dats in first for champs over the last 25 years
first / 25

95.88

In [10]:
data = pd.DataFrame(team)

In [11]:
data['year'] = year

In [12]:
data['days_in_1st'] = days_in_1st

In [13]:
data.describe()

              year  days_in_1st
count    25.000000    25.000000
mean   2007.000000    95.880000
std       7.359801    54.228928
min    1995.000000     0.000000
25%    2001.000000    63.000000
50%    2007.000000   108.000000
75%    2013.000000   141.000000
max    2019.000000   161.000000

In [14]:
data

      0  year  days_in_1st
0   WAS  2019            0
1   BOS  2018          148
2   HOU  2017          154
3   CHC  2016          159
4   KCR  2015          143
5   SFG  2014           89
6   BOS  2013          141
7   SFG  2012           79
8   STL  2011           63
9   SFG  2010           33
10  NYY  2009           82
11  PHI  2008           79
12  BOS  2007          150
13  STL  2006          129
14  CWS  2005          161
15  BOS  2004           34
16  FLA  2003            0
17  ANA  2002           12
18  ARI  2001          108
19  NYY  2000          127
20  NYY  1999          131
21  NYY  1998          135
22  FLA  1997           11
23  NYY  1996          138
24  ATL  1995           91